{ 
  "recipes": [ 
        { 
            "id":1,
            "name": "Jollof Rice", 
            "description": "A popular West African dish with flavorful tomato-based rice.", 
            "ingredients": [ "2 cups long-grain rice", "1 cup tomato sauce", "1 onion, chopped", "2 red bell peppers, chopped", "2 cups chicken or vegetable broth", "1 tsp thyme", "1 tsp curry powder", "1 tsp paprika", "Salt and pepper to taste", "Cooking oil", "Optional: diced chicken, shrimp, or vegetables" ], 
            "instructions": [ "In a pot, sauté chopped onions and red bell peppers in oil until soft.", "Add tomato sauce, thyme, curry powder, paprika, salt, and pepper. Cook for a few minutes.", "Rinse rice and add to the pot, stirring to coat the rice with the tomato mixture.", "Pour in broth and bring to a boil. Reduce heat, cover, and let simmer until rice is cooked.", "Optional: Add diced chicken, shrimp, or vegetables during cooking for additional flavor.", "Fluff the rice with a fork and serve hot." ], 
            "image": "RecipeImg/Jollof  Rice .webp" 
        },
        { 
               "id":2,
                "name": "Stuffed Bell Peppers Rice", 
                "description": "Bell peppers stuffed with seasoned rice and ground meat.", 
                "ingredients": [ "4 large bell peppers", "1 cup cooked rice", "1/2 lb ground meat (beef, turkey, or chicken)", "1 onion, finely chopped", "2 cloves garlic, minced", "1 cup tomato sauce", "1 tsp thyme", "1/2 tsp cayenne pepper", "Salt and pepper to taste", "Cooking oil", "Grated cheese for topping" ], 
                "instructions": [ "Preheat the oven to 375°F (190°C).", "Cut the tops off the bell peppers and remove the seeds and membranes.", "In a skillet, heat oil and sauté chopped onions and minced garlic until translucent.", "Add ground meat and cook until browned. Season with thyme, cayenne pepper, salt, and pepper.", "Stir in cooked rice and tomato sauce. Mix well.", "Stuff the bell peppers with the rice mixture and place them in a baking dish.", "Top each stuffed pepper with grated cheese.", "Cover the dish with foil and bake for 25-30 minutes, until peppers are tender.", "Remove foil and bake for an additional 5-10 minutes to melt the cheese.", "Serve the stuffed bell peppers rice hot." ], 
                "image": "RecipeImg/stuffed-bell-peppers-rice.jpg" 
            }, 
            { 
               "id":3,
                "name": "Seafood Jambalaya", 
                "description": "A Nigerian twist on the classic Louisiana dish with seafood and rich flavors.", 
                "ingredients": [ "2 cups parboiled rice", "1/2 lb shrimp, peeled and deveined", "1/2 lb squid or calamari rings", "1/2 lb mussels, cleaned", "1 onion, chopped", "1 bell pepper, diced", "3 cloves garlic, minced", "1 cup tomato sauce", "1 cup chicken broth", "1 tsp paprika", "1/2 tsp cayenne pepper", "1/2 tsp thyme", "Salt and pepper to taste", "Cooking oil", "Fresh parsley for garnish" ], 
                "instructions": [ "In a large pot, sauté chopped onions, bell peppers, and minced garlic in oil until softened.", "Add shrimp, squid, and mussels. Cook until seafood is partially cooked.", "Stir in tomato sauce, paprika, cayenne pepper, thyme, salt, and pepper.", "Add parboiled rice and coat with the sauce.", "Pour in chicken broth and bring to a boil. Reduce heat, cover, and let simmer until rice is cooked.", "Adjust seasoning as needed. Garnish with fresh parsley before serving." ], 
                "image": "RecipeImg/seafood-jambalaya.jpg" 
            },
            { 
                "id":4,
                "name": "Coconut Rice", 
                "description": "A fragrant and creamy rice dish made with coconut milk.", 
                "ingredients": [ "2 cups jasmine or basmati rice", "1 can (13.5 oz) coconut milk", "1 onion, chopped", "2 cloves garlic, minced", "1 tsp ginger, grated", "1 red bell pepper, chopped", "1 cup green peas", "2 tbsp vegetable oil", "Salt to taste", "Fresh cilantro for garnish" ], 
                "instructions": [ "In a pot, heat vegetable oil and sauté chopped onions, garlic, and grated ginger until fragrant.", "Add chopped red bell pepper and green peas, and cook for a few minutes.", "Rinse rice and add to the pot, stirring to combine with the vegetables.", "Pour in coconut milk and enough water to cook the rice (follow rice-to-liquid ratio on rice package).", "Add salt, cover the pot, and let simmer until rice is cooked and liquid is absorbed.", "Fluff the rice with a fork, garnish with fresh cilantro, and serve." ], 
                "image": "RecipeImg/coconut-rice .jpg" 
            }, 
            { 
                "id":5,
                "name": "Fried Rice", 
                "description": "A colorful and flavorful rice dish loaded with vegetables and protein.", 
                "ingredients": [ "2 cups cooked white rice, cooled", "1 cup mixed vegetables (carrots, peas, corn)", "1/2 cup cooked diced chicken or shrimp", "1/4 cup diced bell peppers (various colors)", "1/4 cup diced onions", "2 cloves garlic, minced", "2 eggs, beaten", "3 tbsp soy sauce", "1 tbsp vegetable oil", "Salt and pepper to taste", "Optional: sliced green onions for garnish" ], 
                "instructions": [ "In a pan, heat vegetable oil and sauté diced onions and minced garlic until fragrant.", "Push the onions and garlic to the side and pour beaten eggs into the pan. Scramble until cooked.", "Add diced bell peppers and mixed vegetables, and stir-fry until tender.", "Add diced chicken or shrimp, and continue to stir-fry for a few minutes.", "Add cooked rice to the pan and break up any clumps. Drizzle with soy sauce.", "Stir-fry everything together until well combined and heated through.", "Season with salt and pepper to taste. Garnish with sliced green onions if desired.", "Serve hot as a flavorful fried rice dish." ], 
                "image": "RecipeImg/fried-rice.jpg"
         }, 
         { 
            "id":6,
            "name": "Rice Pilaf", 
            "description": "A flavorful and aromatic rice dish cooked with broth and spices.", 
            "ingredients": [ "2 cups long-grain rice", "1/4 cup butter or cooking oil", "1 onion, finely chopped", "2 cloves garlic, minced", "4 cups chicken or vegetable broth", "1 tsp dried thyme", "1 tsp dried oregano", "1/2 tsp turmeric", "Salt and pepper to taste", "Chopped fresh parsley for garnish" ], 
            "instructions": [ "In a large skillet or pot, melt the butter over medium heat.", "Add chopped onions and minced garlic. Sauté until onions are translucent.", "Stir in the rice and cook for a few minutes, until the rice is lightly toasted.", "Add dried thyme, dried oregano, and turmeric. Season with salt and pepper.", "Pour in the chicken or vegetable broth and bring to a boil.", "Reduce heat to low, cover, and simmer for about 15-20 minutes, or until rice is cooked and liquid is absorbed.", "Remove from heat and let the rice sit, covered, for a few minutes.", "Fluff the rice with a fork, garnish with chopped parsley, and serve." ], 
            "image": "RecipeImg/rice-pilaf.jpg"

          },
          { 
            "id":7,
            "name": "Cilantro Lime Rice", 
            "description": "A refreshing and zesty rice dish infused with cilantro and lime flavors.", 
            "ingredients": [ "2 cups jasmine rice", "4 cups water", "1 cup fresh cilantro, finely chopped", "1 lime, zest and juice", "Salt to taste" ], 
            "instructions": [ "Rinse the jasmine rice under cold water until the water runs clear.", "In a pot, bring 4 cups of water to a boil. Add the rinsed rice and a pinch of salt.", "Reduce heat to low, cover, and let the rice simmer for about 15-18 minutes, or until the rice is cooked and the water is absorbed.", "Remove from heat and let the rice sit, covered, for a few minutes.", "In a bowl, mix together the finely chopped cilantro, lime zest, and lime juice.", "Fluff the cooked rice with a fork and gently fold in the cilantro-lime mixture.", "Season with additional salt if needed.", "Serve the cilantro lime rice as a flavorful and refreshing side dish." ], 
            "image": "RecipeImg/cilantro-lime-rice.jpg"

          },
          { 
            "id":8,  
            "name": "Mexican Rice", 
            "description": "A flavorful and vibrant rice dish with tomatoes, bell peppers, and spices.", 
            "ingredients": [ "2 cups long-grain rice", "1/4 cup cooking oil", "1 onion, finely chopped", "1 bell pepper, diced", "2 cloves garlic, minced", "1 cup tomato sauce", "2 cups chicken or vegetable broth", "1 tsp ground cumin", "1 tsp chili powder", "1/2 tsp paprika", "Salt to taste", "Fresh cilantro for garnish" ], 
            "instructions": [ "Rinse the long-grain rice under cold water until the water runs clear.", "In a large skillet, heat the cooking oil over medium heat.", "Add chopped onions and diced bell pepper. Sauté until onions are translucent.", "Stir in minced garlic and cook for an additional minute.", "Add the rice to the skillet and cook, stirring frequently, until the rice is lightly toasted.", "Pour in the tomato sauce, ground cumin, chili powder, paprika, and salt. Mix well.", "Add chicken or vegetable broth, and bring to a boil.", "Reduce heat to low, cover, and let the rice simmer for about 15-18 minutes, or until the rice is cooked and the liquid is absorbed.", "Remove from heat and let the rice sit, covered, for a few minutes.", "Fluff the rice with a fork, garnish with fresh cilantro, and serve." ], 
            "image": "RecipeImg/Mexican Rice.jpg" 
          
          }, 
          { 
            "id":9,  
            "name": "Saffron Rice", 
            "description": "A fragrant and elegant rice dish made with saffron threads.", 
            "ingredients": [ "2 cups Basmati rice", "4 cups water", "1/4 tsp saffron threads", "2 tbsp warm milk", "2 tbsp butter", "Salt to taste" ], 
            "instructions": [ "Rinse the Basmati rice under cold water until the water runs clear.", "In a small bowl, soak the saffron threads in warm milk for about 15 minutes.", "In a pot, bring 4 cups of water to a boil. Add the rinsed rice and a pinch of salt.", "Reduce heat to low, cover, and let the rice simmer for about 15-18 minutes, or until the rice is cooked and the water is absorbed.", "Remove from heat and let the rice sit, covered, for a few minutes.", "Gently fluff the cooked rice with a fork.", "Melt the butter in a pan and stir in the saffron-infused milk. Drizzle the saffron mixture over the cooked rice and gently mix to distribute the saffron color and flavor.", "Serve the saffron rice as a visually stunning and aromatic side dish." ], 
            "image": "RecipeImg/seafood-jambalaya.jpg" 
          
          },
          { 
            "id":10,  
            "name": "Chicken Fried Rice", 
            "description": "A classic Chinese dish featuring fried rice with tender pieces of chicken and vegetables.", 
            "ingredients": [ "2 cups cooked rice, chilled", 
            "1 cup cooked chicken breast, diced", 
            "1 cup mixed vegetables (carrots, peas, corn)", 
            "2 eggs, beaten", "2 cloves garlic, minced", 
            "2 tbsp soy sauce", "1 tbsp oyster sauce", 
            "1 tbsp vegetable oil", "Salt and pepper to taste", 
            "Sliced green onions for garnish" ], 
            "instructions": [ "In a large skillet or wok, heat vegetable oil over medium-high heat.", "Add minced garlic and sauté until fragrant.", "Push the garlic to the side and pour beaten eggs into the skillet. Scramble until cooked.", "Add diced chicken breast to the skillet and stir-fry for a few minutes.", "Add mixed vegetables and cook until they start to soften.", "Add chilled cooked rice to the skillet and break up any clumps. Stir-fry to mix with the chicken and vegetables.", "Drizzle soy sauce and oyster sauce over the rice. Mix well to distribute the flavors.", "Season with salt and pepper to taste.", "Garnish with sliced green onions before serving." ], 
            "image": "RecipeImg/chicken-fried-rice.jpg" 
          
          },
          { 
            "id":11,  
            "name": "Dirty Rice", 
            "description": "A flavorful Southern dish with rice cooked with ground meat, vegetables, and spices.", 
            "ingredients": [ "2 cups white rice", "1/2 lb ground pork or beef", "1/2 cup diced onion", "1/4 cup diced celery", "1/4 cup diced bell pepper", "2 cloves garlic, minced", "1 tsp dried thyme", "1 tsp dried oregano", "1/2 tsp paprika", "1/4 tsp cayenne pepper", "Salt and pepper to taste", "2 cups chicken or beef broth", "2 tbsp cooking oil", "Chopped fresh parsley for garnish" ], 
            "instructions": [ "In a large skillet, heat cooking oil over medium-high heat.", "Add ground pork or beef and cook until browned.", "Add diced onion, diced celery, and diced bell pepper. Sauté until vegetables are tender.", "Stir in minced garlic and cook for an additional minute.", "Add dried thyme, dried oregano, paprika, cayenne pepper, salt, and pepper. Mix well.", "Add white rice to the skillet and stir to coat the rice with the mixture.", "Pour in chicken or beef broth and bring to a boil.", "Reduce heat to low, cover, and let the rice simmer for about 15-18 minutes, or until the rice is cooked and the liquid is absorbed.", "Remove from heat and let the rice sit, covered, for a few minutes.", "Fluff the rice with a fork, garnish with chopped fresh parsley, and serve." ], 
            "image": "RecipeImg/dirty-rice.jpg" 
        
        }
  ] 
}